[
  {
    "titre": "Lancement de l'application",
    "version": "1.0.0",
    "date": "Juillet 2021",
    "description": "Première version du \"Jeu du 301\" permettant de créer une partie en rentrant le nom des joueurs et le nombre de palets par participant, avec la possibilité de reprendre la partie plus tard."
  },
  {
    "titre": "Refonte majeure",
    "version": "2.0.0",
    "special": "Refonte majeure",
    "date": "Juillet 2022",
    "description": "Deuxième version de \"301 le Jeu\", reprenant la base de la première version mais avec une refonte totale du design de l'application."
  },
  {
    "titre": "Ajout de fonctionnalités",
    "version": "2.1.0",
    "date": "Aout 2022",
    "description": "Après la refonte de l'application, perfectionnement de l'apparence et du Design System ainsi que début de l'ajout de fonctionnalités majeures."
  },
  {
    "titre": "Fonctionnalités majeures",
    "version": "2.3.0",
    "date": "Octobre 2022",
    "description": "Ajout à l'application des nouvelles fonctionnalités : refonte du Menu, ajout des Joueurs et du Profil et Statistiques des joueurs."
  },
  {
    "titre": "Corrections et micro-fonctionnalités",
    "version": "2.3.25",
    "special": "Corrections",
    "date": "Décembre 2022",
    "description": "Ajout de la page \"Logs\" permettant la lecture de l'historique des fonctionnalités de l'application ainsi que corrections de divers bugs mineurs entraînant une difficulté à utiliser pleinement l'application + légers ajouts et modifications de design."
  },
  {
    "titre": "Ajouts de statistiques",
    "version": "2.4.10",
    "date": "Février 2023",
    "description": "Ajout de la page \"Classement des joueurs\", montrant le classement des joueurs selon plusieurs facteurs (Victoires, Points ou Position moyenne). Ajout également de certaines statistiques sur la liste des joueurs."
  },
  {
    "titre": "Changements de design",
    "version": "2.5.22",
    "special": "Refonte mineure",
    "date": "Avril 2023",
    "description": "Refonte globale du design de l'application, modifications de certaines fonctionnalités (création de partie, mode sombre) et optimisation des performances."
  },

]
